In [5]:
data={'name':['john','alice','bob','emily'],
      'age':[25,30,35,40],
      'gender':['male','female','male','female']}

In [7]:
data

{'name': ['john', 'alice', 'bob', 'emily'],
 'age': [25, 30, 35, 40],
 'gender': ['male', 'female', 'male', 'female']}

In [11]:
import pandas as pd

In [13]:
df=pd.DataFrame(data)

In [15]:
df

    name  age  gender
0   john   25    male
1  alice   30  female
2    bob   35    male
3  emily   40  female

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [21]:
df.shape

(4, 3)

In [25]:
df.ndim

2

In [29]:
df.head(2)

    name  age  gender
0   john   25    male
1  alice   30  female

In [33]:
df.at[2,'age']

35

In [37]:
df[df['age']>30]

    name  age  gender
2    bob   35    male
3  emily   40  female

In [109]:
data_missing={'name':['john','alice','bob','emily'],'age':[25,30,None,40],'gender':['male',None,'male','female']}

In [111]:
df_missing=pd.DataFrame(data_missing)

In [113]:
df_missing

    name   age  gender
0   john  25.0    male
1  alice  30.0    None
2    bob   NaN    male
3  emily  40.0  female

In [115]:
df_dropped=df_missing.dropna()

In [117]:
df_dropped

    name   age  gender
0   john  25.0    male
3  emily  40.0  female

In [119]:
df_filled=df_missing.fillna(df_missing['age'].mean())

In [121]:
df_filled

    name        age     gender
0   john  25.000000       male
1  alice  30.000000  31.666667
2    bob  31.666667       male
3  emily  40.000000     female